Revit 2024 API
UnitTypeId.CurrencyPerBritishThermalUnitPerHour Property
 Cost per British thermal unit per hour.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId CurrencyPerBritishThermalUnitPerHour { get; }
Visual Basic
Public Shared ReadOnly Property CurrencyPerBritishThermalUnitPerHour As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ CurrencyPerBritishThermalUnitPerHour {
	ForgeTypeId^ get ();
}
See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace